new_settings.org
#+title: New Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/Dropbox/3_Emacs/Common/new_main.el

* Suppress Warnings

This is setup to suppress warnings about the system tray and so on.

#+begin_src emacs-lisp
(setq warning-minimum-level :emergency)
#+end_src



* Package Settings
  
Set up package sources and initialize the package system.

#+begin_src emacs-lisp
(setq default-directory "~/Dropbox/3_Emacs")
(add-to-list 'load-path "~/.emacs.d/lisp/")
(add-to-list 'load-path "/home/michael/Dropbox/3_Emacs/")

(setq package-check-signature nil)

(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

;(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(package-initialize)

(add-to-list 'load-path "~/.emacs.d/el-get/el-get")

;; Use-package initialisation but this is for non-linux platforms....
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)

; Makes sure that it installs the package automatically if it isn't already
(setq use-package-always-ensure t)

(unless (require 'el-get nil t)
  (url-retrieve
   "https://raw.github.com/dimitri/el-get/master/el-get-install.el"
   (lambda (s)
     (end-of-buffer)
     (eval-print-last-sexp))))
#+end_src


* Custom set variables

#+begin_src
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(ansi-color-names-vector
   ["#242424" "#e5786d" "#95e454" "#cae682" "#8ac6f2" "#333366" "#ccaa8f" "#f6f3e8"])
 '(async-shell-command-buffer 'new-buffer)
 '(custom-enabled-themes '(spacemacs-dark))
 '(custom-safe-themes
   '("7b3d184d2955990e4df1162aeff6bfb4e1c3e822368f0359e15e2974235d9fa8" "c83c095dd01cde64b631fb0fe5980587deec3834dc55144a6e78ff91ebc80b19" "730a87ed3dc2bf318f3ea3626ce21fb054cd3a1471dcd59c81a4071df02cb601" "2c49d6ac8c0bf19648c9d2eabec9b246d46cb94d83713eaae4f26b49a8183fc4" "0a41da554c41c9169bdaba5745468608706c9046231bbbc0d155af1a12f32271" "7a994c16aa550678846e82edc8c9d6a7d39cc6564baaaacc305a3fdc0bd8725f" "b5fff23b86b3fd2dd2cc86aa3b27ee91513adaefeaa75adc8af35a45ffb6c499" "4bca89c1004e24981c840d3a32755bf859a6910c65b829d9441814000cf6c3d0" "f2927d7d87e8207fa9a0a003c0f222d45c948845de162c885bf6ad2a255babfd" "e3c64e88fec56f86b49dcdc5a831e96782baf14b09397d4057156b17062a8848" "6b80b5b0762a814c62ce858e9d72745a05dd5fc66f821a1c5023b4f2a76bc910" "aaa4c36ce00e572784d424554dcc9641c82d1155370770e231e10c649b59a074" "c086fe46209696a2d01752c0216ed72fd6faeabaaaa40db9fc1518abebaf700d" "56d10d2b60685d112dd54f4ba68a173c102eacc2a6048d417998249085383da1" "e6ff132edb1bfa0645e2ba032c44ce94a3bd3c15e3929cdf6c049802cf059a2a" "76bfa9318742342233d8b0b42e824130b3a50dcc732866ff8e47366aed69de11" "bffa9739ce0752a37d9b1eee78fc00ba159748f50dc328af4be661484848e476" default))
 '(default-input-method "iast-postfix")
 '(dired-icon-image-size 8)
 '(doc-view-continuous t)
 '(elfeed-feeds
   '("https://www.theguardian.com/help/feeds"))
 '(emms-volume-amixer-card 1)
 '(fancy-splash-image "/home/michael/arch.jpg")
 '(fci-rule-color "#65737E")
 '(inhibit-startup-buffer-menu t)
 '(jdee-db-active-breakpoint-face-colors (cons "#1B2229" "#D08770"))
 '(jdee-db-requested-breakpoint-face-colors (cons "#1B2229" "#A3BE8C"))
 '(jdee-db-spec-breakpoint-face-colors (cons "#1B2229" "#4f5b66"))
 '(line-number-mode nil)
 '(objed-cursor-color "#BF616A")
 '(org-agenda-files
   '("/home/michael/Dropbox/3_Emacs/1_Org_Files/2_Todo_Notes.org" "/home/michael/Dropbox/3_Emacs/1_Org_Files/1_Appointments.org" "/home/michael/Dropbox/1_Work/0_1_Vienna\ Work/0_Notes/20211007100420-1_project_admin.org"))
 '(org-babel-python-command "python3")
 '(org-babel-python-mode 'python3)
 '(org-icalendar-timezone "Europe/Vienna")
 '(org-src-preserve-indentation t)
 '(org-startup-folded t)
 '(package-selected-packages
   '(dired-sidebar neotree pythonic org-gcal expand-region buffer-expose dashboard noxml-fold auto-complete-nxml helm-descbinds alarm-clock guix dired-icon geiser deadgrep vlf markdown-mode ox-pandoc general all-the-icons doom-themes helpful counsel ivy-rich which-key rainbow-delimiters rainbow-delimeters doom-modeline ivy ido-vertical-mode smex bibtex-completion command-log-mode podcaster ob-translate elfeed god-mode resize-window calfw-org google-maps persistent-soft ergoemacs-mode pdf-tools helm-exwm dmenu use-package start-menu bluetooth projectile w3m exwm lua-mode slime elpher emms org-babel-eval-in-repl circe wc-mode ztree sorcery-theme sudo-edit spaces spacemacs-theme auctex beacon org-brain org-tree-slide aproject anaconda-mode helm-bibtex bibtex-utils emacsql-mysql edbi wanderlust wiki-summary elpy ein ebib jabber metaweblog xml-rpc org2blog academic-phrases evil))
 '(podcaster-feeds-urls
   '("https://ipn.li/kernelpanic/feed" "http://sachachua.com/blog/tag/emacs-chat/podcast" "http://hopwag2.podbean.com/feed/"))
 '(quail-keyboard-layout
   "                              `\2541!2\"3\2434$5%6^7&8*9(0)-_=+      qQwWeErRtTyYuUiIoOpP[{]}      aAsSdDfFgGhHjJkKlL;:'@#~    \\|zZxXcCvVbBnNmM,<.>/?                                      ")
 '(quail-keyboard-layout-type "pc105-uk")
 '(rustic-ansi-faces
   ["#2b303b" "#BF616A" "#A3BE8C" "#ECBE7B" "#8FA1B3" "#c678dd" "#46D9FF" "#c0c5ce"])
 '(unicode-fonts-block-font-mapping
   '(("Devanagari"
      ("Sanskrit 2003"))
     ("Emoticons"
      ("Apple Color Emoji" "Symbola" "Quivira"))))
 '(vc-annotate-background "#2b303b")
 '(vc-annotate-color-map
   (list
    (cons 20 "#A3BE8C")
    (cons 40 "#bbbe86")
    (cons 60 "#d3be80")
    (cons 80 "#ECBE7B")
    (cons 100 "#e2ab77")
    (cons 120 "#d99973")
    (cons 140 "#D08770")
    (cons 160 "#cc8294")
    (cons 180 "#c97db8")
    (cons 200 "#c678dd")
    (cons 220 "#c370b6")
    (cons 240 "#c16890")
    (cons 260 "#BF616A")
    (cons 280 "#a35f69")
    (cons 300 "#875e68")
    (cons 320 "#6b5c67")
    (cons 340 "#65737E")
    (cons 360 "#65737E")))
 '(vc-annotate-very-old-color nil))
#+end_src


* Smex

M-x enhancement, built on top of Ido.

#+begin_src emacs-lisp
(use-package smex
  :bind (("M-x" . smex)))
#+end_src



* Python ELPY

#+begin_src emacs-lisp
(use-package elpy
  :ensure t
  :defer t
  :init
  (advice-add 'python-mode :before 'elpy-enable))

(setq python-shell-interpreter "ipython"
      python-shell-interpreter-args "-i --simple-prompt")

(setq elpy-rpc-virtualenv-path 'current)

(use-package code-cells
  :ensure t)

(defun python/scratch ()
  (interactive)
    (let (
          ;; Creates a new buffer object.
         (buf (get-buffer-create "*python-scratch*"))
         )
      ;; Executes functions that would change the current buffer at
      ;; buffer buf
     (with-current-buffer buf
       ;;; Set the new buffer to scratch mode
       (python-mode)
       ;;; Pop to scratch buffer
       (pop-to-buffer buf)
       )))
#+end_src


* Org-mode

#+begin_src emacs-lisp
(setq org-startup-folded t)
(setq org-icalendar-timezone "Europe/Vienna")
(setq org-agenda-span 28)

(defun oa ()
  (interactive)
  (delete-other-windows)
  (split-window-below)
  (find-file "/home/michael/Dropbox/3_Emacs/1_Org_Files/1_Appointments.org")
  (other-window 1)
  (find-file "/home/michael/Dropbox/3_Emacs/1_Org_Files/2_Todo_Notes.org"))

(add-hook 'org-mode-hook (lambda () (setq electric-indent-mode nil)))

;(use-package org-tree-slide
;  :custom
;  (org-image-actual-width nil))

;(org-babel-do-load-languages
; 'org-babel-load-languages
; '((python . t)))

(defvar org-electric-pairs '((?\* . ?\*) (?/ . ?/)
                             (?\_ . ?\_)) "Electric pairs for org-mode.")

(defun org-add-electric-pairs ()
  (setq-local electric-pair-pairs (append electric-pair-pairs org-electric-pairs))
  (setq-local electric-pair-text-pairs electric-pair-pairs))

;(add-hook 'org-mode-hook 'org-add-electric-pairs)
(add-hook 'org-mode-hook 'toggle-truncate-lines)

(defun mike/org-sort-renumber-footnotes ()
  "Sort and renumber all footnotes in an org buffer."
  (interactive)
  (org-footnote-sort)
  (org-footnote-renumber-fn:N))

(defun dots ()
  (interactive)
  (insert "…"))

;(use-package ox-pandoc)
;(require 'ox-pandoc)

'(indent-tabs-mode nil)
(setq org-confirm-babel-evaluate nil)
#+end_src



* Org-roam

Variable *org-roam-v2-ack* suppresses warnings: When set to t, won’t display the annoying warning message about the upgrade. Need to be set before the package is loaded, otherwise won’t take any affect.

org-roam-db-autosync mode is necessary to ensure that the db is synced. It didn't work on Linux mint for some reason.

#+begin_src emacs-lisp
(setq org-roam-v2-ack t)
(use-package org-roam)
(setq org-roam-directory (file-truename "/home/michael/Dropbox/1_Work/0_1_Vienna Work/0_Notes/"))

(org-roam-db-autosync-mode)

(setq org-default-notes-file "/home/michael/Dropbox/1_Work/0_1_Vienna Work/1_Sanskrit_Notes.org")
#+end_src


