new_settings.org
* Org-ref
  
#+begin_src emacs-lisp
(setq reftex-default-bibliography '("/home/michael/Dropbox/1_MAIN_BIB.bib"))

(use-package org-ref
  :ensure t
  :config
  (setq reftex-default-bibliography '("/home/michael/Dropbox/7_Bibliography/1_MASTER.bib")))


(setq bibtex-completion-bibliography '("/home/michael/Dropbox/7_Bibliography/1_MASTER.bib"
					 "/home/michael/Dropbox/1_Work/0_1_Vienna Work/7_Bibliography/1_MASTER.bib"
					 "/home/michael/Dropbox/1_Work/0_1_Vienna Work/7_Bibliography/1_MASTER.bib"
					 "/home/michael/Dropbox/1_Work/0_1_Vienna Work/7_Bibliography/1_MASTER.bib")
	bibtex-completion-library-path '("~/Dropbox/emacs/bibliography/bibtex-pdfs/")
	bibtex-completion-notes-path "~/Dropbox/emacs/bibliography/notes/"
	bibtex-completion-notes-template-multiple-files "* ${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}: \n\nSee [[cite:&${=key=}]]\n"

	bibtex-completion-additional-search-fields '(keywords)
	bibtex-completion-display-formats
	'((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
	  (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
	  (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}"))
	bibtex-completion-pdf-open-function
	(lambda (fpath)
	  (call-process "open" nil 0 nil fpath)))
 
;(require 'org-ref-ivy)
(global-set-key (kbd "C-M-=") 'org-ref-insert-link)
(global-set-key (kbd "C-M-#") 'org-footnote-action)
;(global-set-key (kbd "C-z") 'undo)

(defun biblify ()
  (interactive)
  (insert "#+csl-style: apa-5th-edition.csl
bibliographystyle:unsrt
bibliography:/home/michael/Dropbox/7_Bibliography/1_MASTER.bib"))

(global-set-key (kbd "C-c l") 'org-ref-bibtex-hydra/body)

#+end_src



* Hydra

#+begin_src emacs-lisp
(use-package hydra
  :ensure t)

(global-set-key (kbd "C-c 9") 'hydra-navigation/body)
(global-set-key (kbd "C-c 7") 'hydra-org-roam/body)
(global-set-key (kbd "C-c 8") 'org-agenda)

(setq org-agenda-window-setup 'only-window)

(defhydra hydra-navigation ()
  "navigating hydra"
  ("f"   (dired "/home/michael/Dropbox/1_Work/0_1_Vienna Work") "files")
  ("e"   (dired "/home/michael/Dropbox/3_Emacs") "emacs")
  ("d"   (dired "/home/michael/Desktop") "desktop")
  ("b"   (dired "/home/michael/Dropbox/1_Work/0_1_Vienna Work/2_Book/1_A_Final_Leg/1_Cynthia") "book")
  ("m"   (find-file "/home/michael/Dropbox/3_Emacs/Common/new_settings.org") "new_settings.org")
  ("o"   (find-file "/home/michael/Dropbox/3_Emacs/1_Org_Files/1_Appointments.org") "org")
  ("r"   (dired "/home/michael/Dropbox/") "dropbox")
  ("B"   (dired "/home/michael/Dropbox/7_Bibliography/") "Biblio")
  ("c"   (dired "/home/michael/Dropbox/MAIN_CV") "CV")
  ("p"   (dired "/home/michael/Dropbox/Python") "python")
  ("n"   (dired "/home/michael/Dropbox/1_Work/0_1_Vienna Work/0_Notes") "Notes")
  ("c"   (dired "/home/michael/Dropbox/1_Work/0_Corpus") "Corpus")
  ("s"   (find-file "/home/michael/Dropbox/Python/Practice/snippets.py") "Snippets")
  ("i"   (dired "/home/michael/Documents/Interview") "Interview")
  ("t"   (dired "/home/michael/Dropbox/1_Work/0_1_Vienna Work/1_Chapters/1_Translation") "Translation"))

(defhydra hydra-org-roam ()
  "Sanskrit Hydra"
  ("f" (find-name-dired) "search-dropbox")
  ("s" (search-corpus) "search-corpus"))
#+end_src



* My Keys Minor mode

#+begin_src emacs-lisp
(defvar my-keys-minor-mode-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "C-o") 'next-line)
    (define-key map (kbd "C-j") 'backward-word)
    (define-key map (kbd "M-n") 'forward-paragraph)
    ;(define-key map (kbd "C-n") 'open-line)
    map)
  "my-keys-minor-mode keymap.")

(define-minor-mode my-keys-minor-mode
  "A minor mode so that my key settings override annoying major modes."
  :init-value t
  :lighter "my-keys")

(my-keys-minor-mode 1)
#+end_src


* IDO

Ido-mode enhances emacs switch buffer command and opening file command. It automatically show list of choices as you type (no need to press Tab first).

#+begin_src emacs-lisp
(use-package ido-vertical-mode)
(ido-mode 1)
(ido-vertical-mode 1)
(setq ido-vertical-define-keys 'C-n-and-C-p-only)
#+end_src



* Counsel

** Counsel Web Search

#+begin_src emcas-lisp
(use-package counsel-web)
#+end_src



