new_main.el

(quail-set-keyboard-layout "pc105-uk")
(quail-update-keyboard-layout "pc105-uk")
(setq quail-keyboard-layout-type "pc105-uk")

; These lines are to stop that annoying *Async Shell Command* window from opening.
(defadvice async-shell-command (around hide-async-windows activate)
  (save-window-excursion
    ad-do-it))

;; Interface settings
;; Necessary so you can switch to an EXWM supported program in a different workspace.
(setq exwm-layout-show-all-buffers t)

(use-package helm-exwm
  :ensure t
  :config
  (setq helm-exwm-emacs-buffers-source (helm-exwm-build-emacs-buffers-source))
  (setq helm-exwm-source (helm-exwm-build-source))
  (setq helm-mini-default-sources `(helm-exwm-emacs-buffers-source
                                    helm-exwm-source
                                    helm-source-recentf)))

(defun helm-exwm-switch-to-previous-buffer ()
  (interactive)
  (setq a (car (last (helm-exwm-candidates))))
  (switch-to-buffer a))

(defun helm-exwm-switch-to-next-buffer ()
  (interactive)
  (if (> (length (helm-exwm-candidates)) 2)
      (let ()
	(setq a (first (cdr (helm-exwm-candidates))))
	(switch-to-buffer a))
    (let ()
      (setq a (first (cdr (helm-exwm-candidates))))
      (switch-to-buffer a))))

;; Make it easier to run dmenu
(use-package dmenu)

(defun run-dmenu ()
  (interactive)
  (shell-command "dmenu_run"))

(global-set-key (kbd "C-c C-d") 'run-dmenu)

(require 'itrans-sa)

(defun switch-trans-dev ()
  "Switches to transliteration if in devanagari and vice versa."
  (interactive)
  (if (equal current-input-method "iast-postfix")
      (set-input-method "devanagari-kyoto-harvard")
    (set-input-method "iast-postfix")))

(global-set-key (kbd "M-p") 'backward-paragraph)
(global-set-key (kbd "C-~") 'other-window)
(global-set-key (kbd "M-e") 'helm-exwm)

(defun print-entire-bibtex ()
  (interactive)
  (async-shell-command "python3 /home/michael/Dropbox/Python/1_Bib_Manager/Final/final.py > /home/michael/Dropbox/Python/1_Bib_Manager/Final/Current_Entries_Text.org\n")
  (dired "/home/michael/Dropbox/Python/1_Bib_Manager/Final/"))

;; Use define-mode-abbrev to enter new abbreviations for org mode

(setq abbrev-mode t)
(setq org-src-preserve-indentation t)

(defun mike/insert-org-headers ()
  """Insert the headers you would normally use to publish a document in Latex/ODT."""
  (interactive)
  (insert "#+TITLE: 
#+SUBTITLE: 
#+AUTHOR: 
#+LATEX_CLASS: 
#+LATEX_CLASS_OPTIONS: [letterpaper]
#+OPTIONS: toc:nil"))

(global-hl-line-mode)
 
;; Stuff for TEI critical editing

(defun tei/highlight-next-apparatus-entry ()
  (interactive)
  (search-backward "\"")
  (forward-char)
  (set-mark-command nil)
  (search-forward "\"")
  (backward-char)
  (copy-region-as-kill (region-beginning) (region-end))
  (switch-to-buffer "apparatus.xml")
  (unhighlight-regexp t)
  (highlight-lines-matching-regexp (car kill-ring) 'hi-yellow)
  (switch-to-buffer "output.xml"))

(defun open-thunar ()
  (interactive)
  (async-shell-command (concat "thunar " (s-replace " " "\\ " default-directory))))

(require 'exwm-systemtray)
(exwm-systemtray-enable)
; Need to set height, otherwise tray won't always appear
(setq exwm-systemtray-height 24)

(display-time-mode 1)
(display-battery-mode 1)

; Startup applications
;(call-process-shell-command "blueman-manager" nil 0)
(call-process-shell-command "/opt/dropbox/dropboxd" nil 0)
;(start-process "dropboxd" "new_buffer" "/opt/dropbox/dropboxd")

; These should enable the clipboard
(setq x-select-enable-clipboard t)
(setq interprogram-paste-function 'x-cut-buffer-or-selection-value)

; EXWM Settings

(defun exwm-logout ()
  (interactive)
  (recentf-save-list)
  (save-some-buffers)
  (start-process-shell-command "logout" nil "lxsession-logout"))

(require 'exwm)
(require 'exwm-config)
(exwm-config-default)
(set-frame-parameter nil 'fullscreen 'fullboth)

;; These keys should always pass through to Emacs
(setq exwm-input-prefix-keys
      '(?\C-x
	?\C-u
	?\C-h
	?\M-x
	?\M-`
	?\M-&
	?\M-:
	?\C-\M-j
	?\C-o
	?\C-\s-j
	?\C-\s-l
	?\C-\ ))

; Global-EXWM key bindgs
(setq exwm-input-global-keys
      `(([?\s-r] . exwm-reset)
	(,(kbd "s-n") . helm-exwm-switch-to-next-buffer)
	(,(kbd "s-q") . delete-window)
	(,(kbd "s-Q") . delete-other-windows)
	(,(kbd "s-a") . dmenu)
	(,(kbd "s-y") . intra)
	(,(kbd "s-d") . ido-dired)
	(,(kbd "s-f") . open-thunar)
	(,(kbd "s-m") . open-scratch-bottom)
	(,(kbd "s-t") . shell)
	(,(kbd "s-p"). helm-exwm)
	(,(kbd "<s-tab>") . helm-exwm)
	(,(kbd "<s-q>") . helm-exwm)
	(,(kbd "s-k") . windmove-up)
	(,(kbd "s-j") . windmove-down)
	(,(kbd "s-h") . windmove-left)
	(,(kbd "s-l") . windmove-right)
	(,(kbd "s-s") . resize-window)
	(,(kbd "s-o") . org-roam-node-find)
	(,(kbd "s-H") . windmove-swap-states-left)
	(,(kbd "s-J") . windmove-swap-states-down)
	(,(kbd "s-K") . windmove-swap-states-up)
	(,(kbd "s-L") . windmove-swap-states-right)		
	(,(kbd "C-s-l") . split-window-horizontally)
	(,(kbd "C-s-j") . split-window-vertically)
	(,(kbd "s-i") . split-window-horizontally)
	(,(kbd "s-u") . split-window-vertically)
        (,(kbd "<s-f2>") . emms-volume-mode-minus)
	(,(kbd "<s-f3>") . emms-volume-mode-plus)
        (,(kbd "<XF86AudioRaiseVolume>") . emms-volume-mode-plus)
        (,(kbd "<XF86AudioLowerVolume>") . emms-volume-mode-minus)	
        ([?\s-w] . exwm-workspace-switch)
        ,@(mapcar (lambda (i)
                    `(,(kbd (format "s-%d" i)) .
                      (lambda ()
                        (interactive)
                        (exwm-workspace-switch-create ,i))))
                  (number-sequence 0 9))))

(use-package deadgrep)
(setq deadgrep-max-buffers 1)

(defun search-corpus ()
  "Search through the Sanskrit text corpus using deadgrep."
  (interactive)
  (setq search-term (read-from-minibuffer "Sanskrit text: "))
  (dired "/home/michael/Dropbox/1_Work/0_Corpus")
  (deadgrep search-term))

(global-set-key (kbd "C-x C-j") 'dired/open-current-directory)

(use-package all-the-icons-dired)

(defun dired/open-current-directory ()
  (interactive)
  (dired default-directory))

;(add-hook 'dired-mode-hook (lambda () (dired-icon-mode)))

;; Tool selection may be jedi, or anaconda-mode. This script settle it
;; down with anaconda-mode.
(use-package company
 :ensure t
 :config
 (setq company-idle-delay 0
       company-minimum-prefix-length 2
       company-show-numbers t
       company-tooltip-limit 10
       company-tooltip-align-annotations t
       ;; invert the navigation direction if the the completion popup-isearch-match
       ;; is displayed on top (happens near the bottom of windows)
       company-tooltip-flip-when-above t))

(use-package anaconda-mode
  :ensure t
  :config
  (add-hook 'python-mode-hook 'anaconda-mode)
  (add-hook 'python-mode-hook 'anaconda-eldoc-mode))

(use-package company-anaconda
  :ensure t
  :init (require 'rx)
  :after (company)
  :config
  (add-to-list 'company-backends 'company-anaconda))

(use-package company-quickhelp
  ;; Quickhelp may incorrectly place tooltip towards end of buffer
  ;; See: https://github.com/expez/company-quickhelp/issues/72
  :ensure t)

;(add-to-list 'python-shell-extra-pythonpaths "/home/michael/Documents/Interview")

(setq user-mail-address	"michael.williams@oeaw.ac.at"
      user-full-name	"Michael Thomas Williams")

(setq gnus-select-method '(nnimap "Inbox"
                                  (nnimap-address "exchange.oeaw.ac.at")
                                  (nnimap-server-port 993)
                                  (nnimap-stream tls)))

;(setq send-mail-function		'smtpmail-send-it
;      message-send-mail-function	'smtpmail-send-it
;      smtpmail-smtp-server		"exchange.oeaw.ac.at")


(setq smtpmail-smtp-server "smtp.gmail.com"
      smtpmail-smtp-service 587
      gnus-ignored-newsgroups "^to\\.\\|^[0-9. ]+\\( \\|$\\)\\|^[\"]\"[#'()]")

;;; God mode stuff
