new_settings.org
* God Mode and motion commands

#+begin_src emacs-lisp
;;; God mode stuff

(use-package god-mode)

(defun my-god-mode-update-cursor ()
  (setq cursor-type (if (or god-local-mode buffer-read-only)
                        'box
                      'bar)))

(add-hook 'god-mode-enabled-hook #'my-god-mode-update-cursor)
(add-hook 'god-mode-disabled-hook #'my-god-mode-update-cursor)

;(global-set-key (kbd "<escape>") #'god-local-mode)

; Set to t if you want to retain the transliteration, nil if you just want to have no input method
(setq block-input-toggle nil)

(defun iast-mode ()
  "Switches input toggle when activating god mode on/off."
  (interactive)
  (if (equal block-input-toggle nil)
      (setq block-input-toggle t)
    (setq block-input-toggle nil)))

(defun me/switch-input-method ()
  (interactive)
  (if (or (string= current-input-method "iast-postfix") (string= current-input-method "devanagari-kyoto-harvard"))
      (toggle-input-method)))

(setq old-input-method nil)

(defun mike/god-mode-on-switch-im ()
  (interactive)
  (setq old-input-method current-input-method-title)
  (deactivate-input-method))

(defun mike/god-mode-off-switch-im ()
  (interactive)
  (if (string= old-input-method "InR<")
      (set-input-method "iast-postfix"))
  (if (string= old-input-method "DevKH")
      (set-input-method "devanagari-kyoto-harvard")))

;(add-hook 'god-mode-enabled-hook #'me/switch-input-method)
;(add-hook 'god-mode-disabled-hook #'toggle-input-method)
;(add-hook 'god-mode-disabled-hook (lambda () (if (equal block-input-toggle nil)
;	       (toggle-input-method))))

(add-hook 'god-mode-enabled-hook #'mike/god-mode-on-switch-im)
(add-hook 'god-mode-disabled-hook #'mike/god-mode-off-switch-im)

(shell-command "setxkbmap -layout gb")
(shell-command "xmodmap /home/michael/modmap")

(god-mode)

(define-key god-local-mode-map (kbd ".") #'repeat)
(define-key god-local-mode-map (kbd "i") #'god-local-mode)
(define-key god-local-mode-map (kbd "z") #'repeat)
;(shell-command "/home/michael/footremap.sh")

(defun write-file-copy (filename)
  (interactive "F")
  (write-region (point-min) (point-max) filename))


(define-key god-local-mode-map (kbd "C-S-A") 'cn)
(define-key god-local-mode-map (kbd "C-S-Q") 'cs)

(defun mark-whole-word (&optional arg allow-extend)
  "Like `mark-word', but selects whole words and skips over whitespace.
If you use a negative prefix arg then select words backward.
Otherwise select them forward.

If cursor starts in the middle of word then select that whole word.

If there is whitespace between the initial cursor position and the
first word (in the selection direction), it is skipped (not selected).

If the command is repeated or the mark is active, select the next NUM
words, where NUM is the numeric prefix argument.  (Negative NUM
selects backward.)"
  (interactive "P\np")
  (let ((num  (prefix-numeric-value arg)))
    (unless (eq last-command this-command)
      (if (natnump num)
          (skip-syntax-forward "\\s-")
        (skip-syntax-backward "\\s-")))
    (unless (or (eq last-command this-command)
                (if (natnump num)
                    (looking-at "\\b")
                  (looking-back "\\b")))
      (if (natnump num)
          (left-word)
        (right-word)))
    (mark-word arg allow-extend)))

(defun italicise-word ()
  (interactive)
  (save-excursion
    (goto-char (region-beginning))
    (insert "/"))
  (goto-char (region-end))
  (insert "/"))

(defun boldify-word ()
  (interactive)
  (save-excursion
    (goto-char (region-beginning))
    (insert "*"))
  (goto-char (region-end))
  (insert "*"))

(defun editing/delete-next-quotations ()
  (interactive)
  (search-forward "\"")
  (set-mark-command nil)
  (search-forward "\"")
  (backward-char)
  (kill-region (region-beginning) (region-end)))

(define-key god-local-mode-map (kbd "C-S-E") 'italicise-word)
(define-key god-local-mode-map (kbd "C-S-F") 'forward-word)
(define-key god-local-mode-map (kbd "C-S-B") 'backward-word)
(define-key god-local-mode-map (kbd "C-S-S") 'mike/superscript)
(define-key god-local-mode-map (kbd "C-\"") 'editing/delete-next-quotations)

;(set-fringe-mode 10)

(defun insert-danda ()
  (interactive)
  (insert "|"))

(global-set-key "¬" 'insert-danda)

;(async-shell-command "tint2")
;(async-shell-command "nm-applet")
;(global-set-key (kbd "M-n") 'forward-word)

;; This just makes sure that C-o is always bound to next-line

(defvar my-keys-minor-mode-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "C-o") 'next-line)
    (define-key map (kbd "C-j") 'next-word)
    ;(define-key map (kbd "C-n") 'open-line)
    map)
  "my-keys-minor-mode keymap.")

(define-minor-mode my-keys-minor-mode
  "A minor mode so that my key settings override annoying major modes."
  :init-value t
  :lighter " my-keys")

(my-keys-minor-mode 1)
#+end_src


* Input Methods

#+begin_src emacs-lisp
(defun org-superscript (start end)
  (interactive "r")
  (save-excursion)
  (goto-char end) (insert "}")
  (goto-char start) (insert "^{"))

(defun show-file-name ()
  "Show the full path file name in the minibuffer."
  (interactive)
  (message (buffer-file-name))
  (insert buffer-file-name)
  (kill-new (file-truename buffer-file-name)))

(defun angular ()
  "Insert some angular brackets"
  (interactive)
  (insert "⟨⟩")
  (backward-char 1))

(defun indev ()
  (interactive)
  (set-input-method "devanagari-kyoto-harvard"))

(defun intra ()
  (interactive)
  (set-input-method "iast-postfix"))

(defun inger ()
  (interactive)
  (set-input-method "german"))

(defun dots ()
  (interactive)
  (insert "…"))

(global-set-key (kbd "↓") (lambda () (interactive) (insert "ü")))
(global-set-key (kbd "ø") (lambda () (interactive) (insert "ö")))
(global-set-key (kbd "æ") (lambda () (interactive) (insert "ä")))
(global-set-key (kbd "Æ") (lambda () (interactive) (insert "Ä")))
(global-set-key (kbd "Ø") (lambda () (interactive) (insert "Ö")))
(global-set-key (kbd "↑") (lambda () (interactive) (insert "Ü")))
#+end_src


* Sanskrit Helpers

#+begin_src emacs-lisp
(defun transliterate-iast (text)
  (interactive)
  (insert (shell-command-to-string (concat "python /home/michael/Dropbox/Python/convert_to_dev.py " text))))

(defun nxml-where ()
  "Display the hierarchy of XML elements the point is on as a path."
  (interactive)
  (let ((path nil))
    (save-excursion
      (save-restriction
	(widen)
	(while (and (< (point-min) (point)) ;; Doesn't error if point is at beginning of buffer
		    (condition-case nil
			(progn
			  (nxml-backward-up-element) ; always returns nil
			  t)
		      (error nil)))
	  (setq path (cons (xmltok-start-tag-local-name) path)))
	(if (called-interactively-p t)
	    (message "/%s" (mapconcat 'identity path "/"))
	  (format "/%s" (mapconcat 'identity path "/")))))))

(defun cs ()
  "This helps to make a new bibliography from the main ones. Just select the entry you want to put into the new bibliography, and it's copied over to the buffer new.bib. This can then be saved to a file and processed with a script."
  (interactive)
  (bibtex-mark-entry)
  (kill-ring-save (region-beginning) (region-end))
  (get-buffer-create "new_sanskrit.bib")
  (with-current-buffer "new_sanskrit.bib" (insert "\n\n\n"))
  (with-current-buffer "new_sanskrit.bib" (insert (car kill-ring))))

(defun cn ()
  "This helps to make a new bibliography from the main ones. Just select the entry you want to put into the new bibliography, and it's copied over to the buffer new.bib. This can then be saved to a file and processed with a script."
  (interactive)
  (bibtex-mark-entry)
  (kill-ring-save (region-beginning) (region-end))
  (get-buffer-create "new_normal.bib")
  (with-current-buffer "new_normal.bib" (insert "\n\n\n"))
  (with-current-buffer "new_normal.bib" (insert (car kill-ring))))
#+end_src


