new_settings.org
* Ivy Package Setup

Ivy package - interactive interface for completion in emacs. Consider installing counsel for more. This was lifted from: https://github.com/daviwil/emacs-from-scratch/blob/3075158cae210060888001c0d76a58a4178f6a00/init.el. But I got rid of his ridiculous vim key bindings.

#+begin_src emacs-lisp
(use-package ivy :demand
  ;; diminish ensures that the minor mode doesn't show on the modeline
  :diminish
  :config
  (setq ivy-use-virtual-buffers t
	ivy-count-format "%d/%d ")
  (ivy-mode 1))
#+end_src


* Swiper setup

#+begin_src emacs-lisp
(use-package swiper)
(global-set-key (kbd "C-s") 'swiper)
(global-set-key (kbd "C-r") 'swiper-isearch-backward)
(setq ivy-display-style 'fancy)
#+end_src


* Org-Mode Auto-Tangle

This is lifted from David Willis's configuration file (https://github.com/daviwil/emacs-from-scratch/blob/9388cf6ecd9b44c430867a5c3dad5f050fdc0ee1/Emacs.org).
It ensures every time you save this very file, it gets tangled with the main config file.
  
#+begin_src emacs-lisp
;; Automatically tangle our Emacs.org config file when we save it
(defun efs/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/Dropbox/3_Emacs/Common/main_config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src



* Unicode fonts

#+begin_src emacs-lisp
;(use-package unicode-fonts)
#+end_src


* Other Packages

** EMMS

#+begin_src emacs-lisp
(use-package emms)

(defun vol ()
  (interactive)
  (async-shell-command "pavucontrol --tab=3"))

(global-set-key (kbd "<s-f1>") 'emms-volume-mode-minus)
(global-set-key (kbd "<s-f2>") 'emms-volume-mode-plus)
#+end_src



** Spacemacs Theme

#+begin_src
(use-package spacemacs-theme)
#+end_src


** Which-key

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(use-package expand-region
  :ensure t
  :after er/expand-region)
#+end_src


** Neotree

#+begin_src emacs-lisp
(use-package neotree
  :ensure t)
#+end_src


** Ediff

#+begin_src emacs-lisp
(use-package ediff
  :config (set 'ediff-window-setup-function 'ediff-setup-windows-plain))

(setq ediff-diff-options "--text")
#+end_src


** Popper

#+begin_src emacs-lisp
(use-package popper
  :ensure t
  :bind (("M-`"   . popper-kill-latest-popup)
         ("C-M-`" . popper-toggle-latest))
  :init
  (setq popper-reference-buffers
        '("\\*Messages\\*"
          "Output\\*$"
          help-mode
          compilation-mode))
  (popper-mode +1))

(popper-mode 1)
#+end_src


** Dashboard

#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
    (dashboard-setup-startup-hook)
    (setq dashboard-startup-banner "~/Dropbox/3_Emacs/dashLogo.png")
    (setq dashboard-items '((recents  . 10)
                            (agenda . 10)))
    (setq dashboard-banner-logo-title "ARCH-EMACS-EXWM"))
#+end_src


** Org-Bullets
   
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp/")
;(load "org-bullets.el")
;(require 'org-bullets)
(setq org-bullets-bullet-list '("◉" "○" "✸" "✮" "▶"))
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src


** Arch package Manager

#+begin_src emacs-lisp
(use-package arch-packer)
#+end_src


** PDF-Tools
  
#+begin_src emacs-lisp
;(use-package pdf-tools)
#+end_src


** Doom-modeline

#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 12)))
#+end_src



** ERC

#+begin_src emacs-lisp
(use-package erc
  :ensure t
  :defer t)
#+end_src


** General
#+begin_src emacs-lisp
(use-package general)
(general-define-key
 "C-M-j" 'ivy-switch-buffer)
#+end_src


** All-the-icons

For this to work you need to run *all-the-icons-install-fonts* after installing the package!

#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src






** Treemacs

#+begin_src emacs-lisp
(use-package treemacs)
(setq treemacs--width-is-locked nil)
(setq window-size-fixed nil)
(treemacs-toggle-fixed-width)
#+end_src


** Elfeed

#+begin_src emacs-lisp
(use-package elfeed)

(setq elfeed-feeds
      '("https://archlinux.org/feeds/news/"
        "https://planet.emacslife.com/atom.xml"
        "https://www.anarchistfederation.net/"
        "http://blog.practicalethics.ox.ac.uk/feed/"
        "http://aphilosopher.drmcl.com/feed/"))
#+end_src


* General Settings

** Kill emacs hook

This needs to be added to avoid logout problems in arch.

#+begin_src emacs-lisp
(remove-hook 'kill-emacs-hook 'pcache-kill-emacs-hook)
(global-set-key (kbd "C-c C-r") 'recentf-open-files)

(setq browse-url-browser-function 'browse-url-generic browse-url-generic-program "qutebrowser")


#+end_src


** Key Bindings

#+begin_src emacs-lisp
(define-key dired-mode-map [mouse-2] 'dired-mouse-find-file)

(global-set-key (kbd "C-=") 'er/expand-region)

(global-unset-key (kbd "C-t"))
(push ?\C-t exwm-input-prefix-keys)

(exwm-input-set-key (kbd "C-t v") 'pavucontrol)
(exwm-input-set-key (kbd "C-t t") 'eshell)

(global-set-key (kbd "C-t f")  'mike/org-sort-renumber-footnotes)

(global-set-key (kbd "C-q") 'forward-word)
(global-set-key (kbd "C-j") 'backward-word)
(global-set-key (kbd "M-n") 'forward-paragraph)

(global-set-key (kbd "M-f") 'forward-sentence)
(global-set-key (kbd "M-b") 'backward-sentence)
(global-set-key (kbd "s-`") 'helm-exwm)

(defun xmm ()
  (interactive)
  (shell-command "setxkbmap -layout gb")
  (shell-command "xmodmap /home/michael/modmap"))

(defun run-mm ()
  (interactive)
  (shell-command "xmodmap /home/michael/modmap"))

(global-set-key (kbd "C-c m") 'xmm)

(defun insert-danda ()
  (interactive)
  (insert "|"))

(global-set-key "¬" 'insert-danda)

(defun bull ()
  (interactive)
  (insert "•"))

(defun open-scratch-bottom ()
  (interactive)
  (split-window-below 37)
  (other-window 1)
  (switch-to-buffer "*scratch*")
  (text-mode))

(global-set-key (kbd "C-c 3") 'open-scratch-bottom)
(global-set-key (kbd "M-q") 'company-complete)

(global-set-key (kbd "C-x C-b") 'ibuffer)
(global-set-key (kbd "C-x w") 'counsel-web-search)

;; Preserve the open line functionality
(global-set-key (kbd "C-M-o") 'open-line)

(global-set-key (kbd "M-[") 'previous-buffer)
(global-set-key (kbd "M-]") 'next-buffer)

(defun insert-zero-width-space ()
  (interactive)
  (insert-char ?\u200B))

(defun buffer/copy-path ()
  (interactive)
  (clipboard/set (file-name-directory (buffer-file-name)))
  (message "Copied file path to clipboard"))

(global-set-key (kbd "C-t b") 'buffer/copy-path)

(defun text/scratch ()
  (interactive)
    (let (
         (buf (get-buffer-create "text-scratch")))
     (with-current-buffer buf
       (text-mode)
       (pop-to-buffer buf))))

#+end_src


** Misc Variables

#+begin_src emacs-lisp

;'(org-src-preserve-indentation nil)
(setq sentence-end-double-space nil)
(setq show-trailing-whitespace t)
(setq ring-bell-function 'ignore)

;; Turn on line numbers

(column-number-mode)
(global-display-line-numbers-mode t)

;; Turn line numbers off for various modes

(dolist (mode '(org-mode-hook
		term-mode-hook
		shell-mode-hook
		eshell-mode-hook
		eww-mode))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;(add-hook 'org-mode-hook (lambda () (god-mode-activate)))
;(unicode-fonts-setup)

;; For use in converting docx/odt files to org mode using pandoc

'(indent-tabs-mode nil)
'(org-src-preserve-indentation nil)

(define-key dired-mode-map [mouse-2] 'dired-mouse-find-file)

(setq org-confirm-babel-evaluate nil)
#+end_src




* Startup Applications
  
#+begin_src emacs-lisp
(call-process-shell-command "blueman-applet" nil 0)
(call-process-shell-command "dropbox start" nil 0)
(async-shell-command "nm-applet")

(defun sdropbox ()
  (interactive)
  (call-process-shell-command "dropbox start" nil 0))
#+end_src

#+RESULTS:
: sdropbox



* Evil-mode

