new_settings.org
** Evil mode

#+begin_src emacs-lisp
(god-mode)

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-global-set-key 'motion "m" 'default-indent-new-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'dashboard-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'eww-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'dired-mode 'emacs))

(define-key evil-normal-state-map (kbd "u") 'undo)

(eval-after-load 'evil-core
  '(evil-set-initial-state 'shell-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'eshell-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'exwm-mode 'emacs))

(defalias 'evil-insert-state 'evil-emacs-state)
(setq evil-insert-state-map (make-sparse-keymap))

(define-key evil-normal-state-map (kbd "<escape>") 'evil-emacs-state)
(define-key evil-normal-state-map (kbd "SPC") 'evil-visual-char)
(global-set-key (kbd "<escape>") 'evil-normal-state)

(setq evil-emacs-state-cursor '("firebrick" box)) 
(setq evil-normal-state-cursor '("deep sky blue" box)) 
(setq evil-visual-state-cursor '("deep sky blue" box))
(setq evil-insert-state-cursor '("firebrick" box))
(setq evil-replace-state-cursor '("firebrick" bar))
(setq evil-operator-state-cursor '("firebrick" hollow))

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))
#+end_src


* Outserts
  

This doesn't work at all

Window-divider

This is ignored for the moment. Could be used to create the illusion that there is gaps between the windows

#+begin_src
(setq window-divider-default-places t)
(setq window-divider-default-bottom-width 10)
(setq window-divider-default-right-width 10)
(window-divider-mode)
(set-face-background 'vertical-border "white")
#+end_src


#+begin_src
(use-package eaf
  :load-path "~/.emacs.d/site-lisp/emacs-application-framework" ; Set to "/usr/share/emacs/site-lisp/eaf" if installed from AUR
  :custom
  ; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
  (eaf-browser-continue-where-left-off t)
  (eaf-browser-enable-adblocker t)
  (browse-url-browser-function 'eaf-open-browser)
  :config
  (defalias 'browse-web #'eaf-open-browser)
  (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
  (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
  (eaf-bind-key take_photo "p" eaf-camera-keybinding)
  (eaf-bind-key nil "M-q" eaf-browser-keybinding))

(require 'eaf-browser)
(require 'eaf-pdf-viewer)

;(use-package edwina
;  :ensure t
;  :config
;  (setq display-buffer-base-action '(display-buffer-below-selected))
;  (edwina-setup-dwm-keys)
;  (edwina-mode 1))


;(use-package workgroups)
;(workgroups-mode 1)
;(setq wg-prefix-key (kbd "C-c w"))

;(setq elpy-rpc-backend "jedi")


; Org present
(add-to-list 'load-path "~/Dropbox/3_Emacs/org-present.el")
(autoload 'org-present "org-present" nil t)

(eval-after-load "org-present"
  '(progn
     (add-hook 'org-present-mode-hook
               (lambda ()
                 (org-present-big)
                 (org-display-inline-images)
                 (org-present-hide-cursor)
                 (org-present-read-only)))
     (add-hook 'org-present-mode-quit-hook
               (lambda ()
                 (org-present-small)
                 (org-remove-inline-images)
                 (org-present-show-cursor)
                 (org-present-read-write)))))


(defun switch-to-evil-mode ()
  (interactive)
  (evil-mode 1)
  (define-key evil-normal-state-map (kbd "k") 'evil-previous-visual-line)
  (define-key evil-normal-state-map (kbd "j") 'evil-next-visual-line)				       
  (define-key evil-normal-state-map (kbd "C-u") 'evil-scroll-up)
  (define-key evil-visual-state-map (kbd "C-u") 'evil-scroll-up)
  (define-key evil-insert-state-map (kbd "C-u")
  (lambda ()
    (interactive)
    (evil-delete (point-at-bol) (point))))
  (evil-mode 0))

(defalias 'scroll-ahead 'scroll-up)
(defalias 'scroll-behind 'scroll-down)

(defun scroll-one-line-ahead ()
  "This just scrolls ahead one line."
  (interactive)
  (scroll-behind 1))

(defun scroll-one-line-behind ()
  "This just scrolls one line behind."
  (interactive)
  (scroll-up 1))

