new_main.el

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-global-set-key 'motion "m" 'default-indent-new-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'dashboard-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'eww-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'dired-mode 'emacs))

(define-key evil-normal-state-map (kbd "u") 'undo)

(eval-after-load 'evil-core
  '(evil-set-initial-state 'shell-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'eshell-mode 'emacs))

(eval-after-load 'evil-core
  '(evil-set-initial-state 'exwm-mode 'emacs))

(defalias 'evil-insert-state 'evil-emacs-state)
(setq evil-insert-state-map (make-sparse-keymap))

(define-key evil-normal-state-map (kbd "<escape>") 'evil-emacs-state)
(define-key evil-normal-state-map (kbd "SPC") 'evil-visual-char)
(global-set-key (kbd "<escape>") 'evil-normal-state)

(setq evil-emacs-state-cursor '("firebrick" box)) 
(setq evil-normal-state-cursor '("deep sky blue" box)) 
(setq evil-visual-state-cursor '("deep sky blue" box))
(setq evil-insert-state-cursor '("firebrick" box))
(setq evil-replace-state-cursor '("firebrick" bar))
(setq evil-operator-state-cursor '("firebrick" hollow))

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))
